[
  {
    "q": "How does the YouTube algorithm work in 2025?",
    "a": "YouTube's algorithm prioritizes watch time, click-through rate (CTR), and viewer satisfaction. Key signals: Average view duration (aim for 50%+ retention), CTR (8-12% is excellent for new channels), session time (viewers watching multiple videos), engagement velocity (comments/likes in first hour), and watch pattern (viewers returning).",
    "source": "Understanding the YouTube Algorithm in 2025 section"
  },
  {
    "q": "What's the viral video formula?",
    "a": "Hook within 3 seconds using results/transformation, pattern interruption, or specific value promise. Structure: Minutes 0-2 (Hook + Promise + Quick win), Minutes 2-5 (Main content with actionable steps), Minutes 5-8 (Advanced tips and examples), Minute 8+ (Summary, call-to-action, next video tease).",
    "source": "The Viral Video Formula section"
  },
  {
    "q": "How do I create effective thumbnails?",
    "a": "Use color psychology (Red/Orange for urgency, Blue/Green for trust, Yellow for curiosity), follow 60-30-10 rule (60% background, 30% subject, 10% accent). Text should be maximum 3-4 words in large font, use curiosity gaps and power words like 'Ultimate', 'Secret', 'Exposed'.",
    "source": "Thumbnail Psychology That Converts section"
  },
  {
    "q": "How do I grow from 0 to 1K subscribers?",
    "a": "Find your niche intersection (combine 2-3 topics you know well), research underserved topics using YouTube autocomplete and competitor analysis, focus on content quality over quantity (1-2 exceptional videos weekly), and ensure each video provides genuine value.",
    "source": "The 0-1K Subscribers Phase: Foundation Building section"
  },
  {
    "q": "What topics should I create content about?",
    "a": "Use YouTube search autocomplete for topic ideas, check competitor videos with 10K-100K views (sweet spot), look for topics with high search volume but low competition, and analyze comments asking 'how to' questions on big channels.",
    "source": "Research underserved topics subsection"
  },
  {
    "q": "How important is the first 3 seconds?",
    "a": "Extremely critical. Open with results or transformation, use pattern interruption with unexpected statements, and promise specific value upfront. Example: 'I gained 50K subscribers in 30 days - here's the exact strategy'.",
    "source": "Hook within 3 seconds subsection"
  }
]